app/Controllers/compra_controller.php

    public function formValidation()
    {
        $input = $this->validate([
            'nombre' => 'required|min_length[3]',
            'categoria' => 'required|min_length[3]|max_length[25]',
            'marca' => 'required|min_length[4]|max_length[10]',

        ]);

        $formModel = new producto_Model();

        if (!$input) {
            $data['titulo'] = 'Compra';
            echo view('front/head', $data);
            echo view('front/navbar_view');
            echo view('front/compra', ['validation' => $this->validator]);
            echo view('front/footer_view');
        } else {
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'categoria' => $this->request->getVar('categoria'),
                'marca' => $this->request->getVar('marca'),
            ]);
---
INSERT INTO `productos` (`nombre`, `categoria`, `marca`) VALUES ('Soft Pinch Tinted Lip Oil', 'Labios', 'PEpe')